{
	"page" : {
		"title" : "Cathedral Tour",
		"intro" : ""
	},
	"body-text" : "<p class=\"intro\">Please see <a href=\"index.html#hours\">Cathedral Hours</a> for visiting times. If you wish to schedule a tour, please <a href=\"staff.html\">contact our Sexton</a>.</p><p>Welcome to Saint Sophia Greek Orthodox Cathedral! Though judging from the name \"Saint Sophia\" it would seem the cathedral is named for a female saint of the Orthodox Christian tradition, the cathedral is actually dedicated to the \"Holy Wisdom of God.\" (\"Agia Sophia\" in Greek). Our community sincerely hopes you enjoy your visit; in addition, you are welcome to join us for worship every Sunday morning, beginning at 10:00 a.m. Your presence is a blessing for our community—and we hope that this magnificent cathedral fills you with inspiration, just as it continually does for our congregation. What follows is a brief introduction to the history and sacred tradition that lie at the heart of this great edifice, our Los Angeles congregation, and the Orthodox Christian faith. As the title of this publication suggests, we hope you are provided with a host of helpful and inspiring INSIGHTS into our Saint Sophia community!</p><img src=\"http://www.stsophia.org/images/saint_sophia_cathedral_tour_photo_617px.jpg\"><p>Saint Sophia Cathedral is patterned after Saint Sophia of Constantinople (now Istanbul), the great and ancient church of Eastern Christendom, but offers a number of unique and exciting departures. Charles P. Skouras, the major benefactor of this magnificent Cathedral, architect Gus Kalionzes and iconographer/artist William Chavalas did not closely follow the sometimes rigid Byzantine tradition. The architecture in its entirety is rather an evocation of the great Byzantine spirit and reflects the influences of both the Hellenistic and Byzantine periods. The artist conducted extensive research on churches of the world throughout the ages. He did not copy any one style, but kept the basic traditions connected with the Christian faith.</p><p>As the Cathedral is approached from the street, it is readily observed that the structure of the exterior has been designed in very simple but proportionate lines expressing the art and architecture of Byzantine tradition. The only decorative artwork installed in relief is at the main entrance and at the north and south exits. The relief work consists of a massive scroll design, of a leaf and grape theme, that is a universal Christian symbol pointing to the EuchariSaint A large rose patterned window of multi-colored glass adorns the upper portion of the relief areas. The main entrance relief area also contains two peacocks drinking from a fountain, representing an ancient symbol of eternal life. The solid oak hand-carved doors of the main, north and south entrances are carved in a Byzantine style thirteenth century pattern. Restoration of the doors was recently completed. Due to their exposure to the elements, it became necessary to bronze the doors in order to preserve their beauty.</p><p>The interior of the Cathedral, as with any Orthodox Church, is divided into three areas: the Narthex, the Nave and the Sanctuary. The Narthex is the first area and is in a lobby-style design. The walls are sided from floor to ceiling in marble and the floor is antique verdi marble. There are two shrines made of onyx, each framing an icon of hand-carved silver. The one on the right depicts the Queen of Heaven, the Virgin Mary and Christ-child. On the left is the artist's conception of the dedication, or name, of the Cathedral which, in this case, as mentioned, represents the \"Holy Wisdom of God.\" This Narthex area was, at one time in the Orthodox Church’s history, intended to accommodate those who were being instructed in the faith but had not yet been baptized. Therefore, they were not permitted to enter the Nave or to participate in the Divine Liturgy. Today the Narthex is a place of preparation where the faithful offer their first prayers to God, venerate the icons and light candles proclaiming Christ to be the light of the world.</p><p>Upon entering from the Narthex, the interior of the Cathedral is given its fullest expression, employing all possible artistic media and precious metals blended into a great symphony of incomparable light and beauty. The intent is to captivate the heart and mind of the worshiper. With the aid of music and liturgical readings, the worshiper is moved with the sense of the Divine Presence and of direct communication with God.</p><p>The Nave, or the church proper, is the pew area that is occupied by the congregation and is surrounded by 55 paintings inspired by scripture and holy tradition. The lower portion of the Nave walls are constructed with matched marble in the likeness of Saint Sophia of Constantinople. The Nave floor is finished in terrazzo. The Solea is the elevated area of the Nave that is immediately in front of the Iconostasion, or Icon Screen, and is used for liturgical worship services, processions and celebrations of the Sacraments. A bronze-and-white onyx rail separates the Solea from the pew area of the Nave.</p><p>The ceiling is divided into three parts: the main center arch running the length of the Nave, two growing vaults (one on each side of the main arch) and the dome. The growing vaults extend eight feet from the exterior walls have engaged double capitals against the walls—and disengaged capitals outward from the walls. Instead of having columns down to the floor to support the disengaged capitals, as seen in many church designs, the architect incorporated crystal chandeliers that hang under the disengaged capitals of the vaults. There are a total of 17 Czechoslovakian crystal chandeliers, three of which are a massive 2,000 pounds each.</p><p>The main arch is 33 feet wide and 40 feet above the Nave floor. It is highly ornamented with staff work and gilded with 24-carat gold leaf. A large painting depicting the \"Tree of Jesse,\" or the genealogy of Christ, is painted on the portion of the ceiling from the center dome towards the rear of the Nave. The genealogy is divided into three periods of 14 generations each, from Abraham to the birth of Christ At the base of the tree are Adam and Eve with an angel holding a fiery sword, guarding the entrance into the Garden of Eden.</p><p>The dome is 30 feet in diameter and rises 50 feet above the center arch of the ceiling for a total of 90 feet from the Nave floor. A bust of Christ is painted at the apex of the dome that is 33 feet wide. The head is 10 1/4 feet in diameter and the hand is 7 feet. In all Orthodox churches, the inner shell of the dome is always reserved for a representation of Christ, the Lord of All and the King of the Universe. The crest of the dome is crafted in painted mosaic with an inscription taken from the New Testament: \"I Am the Light of the World. He who believes in me shall not walk in darkness but have the light of life.\"</p><p>There are twenty-four windows around the periphery of the dome, with the spacing between the windows containing icons of the faith. The original figures were painted angels similar in pose to those located on the east and west walls of each transept. Several of the angels were water damaged due to leaks in the dome, and restoration became necessary. These icons were created in mosaic tile by the world-renowned artist Sirio Tonelli, who completed them individually in Italy and had them transported to the Cathedral for installation into the dome. They include: one of the Spirit of Christ, two of archangels and twenty-one of various saints. The icons were donated, through the generosity and love of the Church, by twenty-four parishioners. These donors are identified with their chosen figure of faith on a framed plaque located in the lobby area of the church office.</p><p>The lower rim of the dome contains icons of six major Old Testament prophets with inscriptions written in English and in Greek. At the base of the dome are icons of the four evangelists, Matthew, Mark, Luke and John. Saint Matthew is depicted with a man looking over his shoulder, representing the human genealogy of the Lord. Saint Mark is depicted with a lion for the Royal Dignity of the Lord. Saint Luke is depicted with a calf representing the priesthood and sacrifice of the Lord, while Saint John is depicted with an eagle, the highest flying of all birds, representing the divine nature of the Lord.</p><p>On the north and south walls of the Nave are twelve stained glass windows depicting the twelve Apostles of Christ Each window is 4 feet wide and 18 feet in height. The areas between the windows are highly decorated with 24-carat gold leaf in scroll design, forming medallions that contain icons of the faith.</p><p>The large mural on the north transept of the Nave depicts the trilogy of the Crucifixion. The first panel depicts Christ carrying His Cross on the road to Golgotha; the center panel is the scene of the Crucifixion; and the third panel is the descent from the Cross. Concurrently, the large mural on the south transept of the Nave depicts the trilogy of the Resurrection. The first panel represents the entombment of Christ, the center panel depicts the Resurrection and the third panel depicts the announcement, by the Angel, to the three women at the holy sepulcher that \"He Is Risen.\"</p><p>On the Nave floor, in the same area as the Resurrection murals, there is a slightly raised platform upon which a wooden symbol of the sepulcher rests. This wooden sepulcher, or Kouvouklion, is an elaborate, hand-carved olivewood church accouterment that was imported from Greece. It is decorated with flowers on Holy Friday of Holy Week to represent the funeral and burial of Christ It is customary for the clergy to distribute the flowers of the Epitaphion (the icon of Christs death which is placed inside the Kouvouklion) to the departing parishioners at the conclusion of Holy Friday evening services.</p><p>Also on the Nave floor, but in the area of the Crucifixion murals, is a magnificent bronze-and-copper Baptismal font. This font is self-contained in that it has both hot-and-cold running water, as well as a drain that evacuates the blessed water into a well located below the floor. The well does not connect to the normal sewer system.</p><p>To the north side of the Solea stands the imposing gold leaf pulpit. On the Solea wall, next to the pulpit, are the inscriptions engraved in gold and written in English of the beatitudes of the Sermon on the Mount, the Lord's Prayer and the Nicene Creed. These are inscribed in Greek on the south Solea wall. The Bishop's Throne, or the Throne of Christ, stands on the south side of the Solea and is used by our Metropolitan (archbishop) during worship services. Two lions, one on each side of the throne, symbolize the strength of Christ and the Gospel as proclaimed by episcopal authority. A painting of a double-headed eagle, facing east and west, is located behind the backrest of the Throne. It was the emblem of the Byzantine Empire since, at one time, Byzantium was considered the center of civilization looking toward the east and west</p><p>The choir loft is located on the upper west side of the Nave above the doorway. Originally, the choir loft was equipped with a Wurlitzer pipe organ that accompanied the choir during liturgical services, but was replaced by a new electronic Roger's organ in December 1989. The west wall of the choir loft is the west exterior of the Church and contains the multi-colored glass rose patterned window that was described earlier. A mural painting depicting the Prophet Elijah ascending toward Heaven on a flaming chariot surrounds the choir loft window.</p><p>The Sanctuary is the third area of the interior of the Cathedral and is the most sacred part of the Orthodox Church. It is bordered in front by the Iconostasion and by the Apse to the rear, and with its various appointments symbolizes Heaven. Due to the sacredness of the Sanctuary and Holy Altar, laypersons may not enter this area unless assigned duties related to worship.</p><p>The Holy Altar is in the center of the Sanctuary and is considered to be the celestial throne of the Almighty. It is surrounded by the angelic host singing continuous praises to the Creator. On the front panel of the Altar is a mosaic-tiled icon depicting the entombment of Christ This icon was inspired by Mr. and Mrs. William Oldknow in memory of The Very Reverend Leonidas Contos, 1920-1995, dean of Saint Sophia Cathedral, 1952-1966.</p><p>The Apse is the rear wall of the Sanctuary and is the easternmost wall of the Cathedral. On the upper portion of the Apse, overlooking the Sanctuary, is the sweeping and majestic icon of the Blessed Virgin with arms outstretched and the Christ-child in her bosom. She is represented here as the Queen of Heaven, ready to receive the faithful to the Gates of Heaven. Inscribed in Greek on the arch of the Sanctuary, the translation proclaims: \"This is the Gate of Heaven.\" The painting is 33 feet in diameter and the face is 7 1/2 feet in diameter.</p><p>The middle portion of the Apse contains four icons that depict various times in the life of Christ From left to right, the depictions are: The Miracle of the Wedding in Cana; Our Lord Christ in the Garden of Gethsemane; Christ with \"Doubting Thomas\"; and Christ Blessing the Children. These paintings, in brown tones, are between the three windows of stained glass that depict three of the fathers of the Church: Saint Basil the Great, Saint John Chrysostom and Saint Gregory the Theologian.</p><p>Since the construction of the Cathedral, the lower portion of the Apse had not contained icons or mosaics, but was merely a painted surface. Through his generosity and love for the church, Michael Huffington presented a mural, as a gift, reflecting Psalm 150, a \"Symphony of Angels.\" The angels are celebrating the joy of heavenly liturgy and the awesomeness of the EuchariSaint The mural was created in the ancient mosaic-style by the aforementioned Sirio Tonelli. The angels were completed in Italy and then transported to the Cathedral for installation. Ironically, the artist signed the mural on September 11, 2001, a very dark day in American history.</p><p>The Iconostasion, or Altar Screen, that separates the Sanctuary from the Solea of the Nave, is divided into two sections. The upper section of the screen depicts scenes from the life of Christ and the Virgin Mary while the lower section contains the prayer icons. It is highly ornate with ornamental staff work and gilded in 24-carat gold leaf. Votive lamps, especially designed for the Cathedral, are made of sterling silver and hang over the major icons, illuminating them.</p><p>Entry into the Sanctuary is afforded through the three portals of the Iconostasion. The center portal has an illuminated sliding door with an icon of the resurrected Christ, wearing bright white garments with outstretched arms looking toward the Nave. Immediately in front of the sliding door are two small bronze gates (known as \"The Beautiful Gates\") of open design which the clergy open and close during services. The Beautiful Gates signify where our Lord, the King of Glory, appears to the faithful in the form of the Word revealed through the Holy Gospel and the revelation of the Lord in the Holy Eucharist</p><p>The portal to the left of the Beautiful Gates is an illuminated sliding door, known as the Deacon's Door. It depicts the Archangel Michael who symbolizes guardianship of the entrance to the Sanctuary. A similar door further to the right of the Royal Door represents the Archangel Gabriel, who also symbolizes guardianship to the entrance of the Sanctuary. Non clergy participants in the liturgical and other services may only use these portals to enter the Sanctuary.</p><p>Facing the Icon Screen, eastwardly direction, the first icon to the right of the Royal Door represents Christ on his throne holding the open Gospel Book and proclaiming: \"I am the light of the world. He who believes in me shall not walk in darkness but have the light of life.\" The icon located to the right of the Christ icon is Saint John the Baptist, who is proclaimed to be the forerunner of the Lord. The rightmost icon is Saint Spyridon and is dedicated to Spiros G. Ponty in recognition of his devotion to the Church. Mr Ponty gave unrestrained support to the building and conservation of the Cathedral and was president of its Board of Trustees.</p><p>The first icon to the left of the Royal Door represents the Virgin Mary and the Christ-child. Mary is never pictured without Jesus, and always projects and lifts up the Savior, who is the center of Her life. The icon to the left of the Virgin Mary depicts the \"Holy Wisdom of God,\" or Agia Sophia, and is, as in the Narthex, the artist's conception of the Holy Trinity. The leftmost icon is Saint Athanasios, and it is dedicated to Athanasios K. Mellos in recognition of his active participation in the Church as its president for four years, during the transitional period from the Church of the Annunciation to Saint Sophia Cathedral. Mr. Mellos was also a member of the Cathedral's Board of Trustees.</p><p>Symbols have been used throughout the history of Christianity. Christians resorted to the use of symbols because of persecution, and these can be identified on the walls of the transepts and Iconostasion. During the times of the persecutions, when Christians used the catacombs as churches, their password was ICQUS, which means \"Fish.\" If you take this word apart, treating it as an acronym, it means \"Jesus Christ, God's Son, Savior.\" One of the oldest of all symbols of our Savior is an anchor which symbolizes man's hope—an anchor for the soul which is Jesus Christ One of the most widely used and most striking symbols of our Lord's Atonement is the pelican. The pelican is shown plucking open her breast and feeding her young with her own blood, reminding us that our Lord Jesus Christ has redeemed us and delivered us from mortal sin, death and the power of the evil with His Precious Blood. The descending dove represents the presence of the Holy Spirit, and the Chalice represents the Last Supper and the Communion of the Body and Blood of Christ The symbol of the Lamb of God is of ancient origin, based on the scriptural appoint of Jesus as the \"Lamb of God,\" and myriad examples of this symbol exist throughout the Orthodox world. The symbolism of the mythical phoenix, which is consumed by flame and then reborn from its own ashes, is twofold: the Resurrection of our Lord, and the fact that those who fall asleep in Christ shall rise again to a newness of life. The fish with a basket of bread symbolizes the body of Christ and refers to the miracle of two fish and fives loaves of bread that were multiplied to feed the 5,000. The symbol of the ship represents the ship in which the apostles sailed in troubled waters across the Sea of Galilee, when our Lord stilled the tempeSaint It also represents the ship of the Church tossed by stormy waves of persecution, schism and other conflict. The eagle, the king of the birds, is a symbol of authority representing the authority of Christ, King of the Heavens.</p><p>As the worshipers exit the cathedral through the Nave's main doors, located on the Nave's west wall, three painted murals are observed. The mural farthest to the left is of Saint George slaying evil in the form of the legendary dragon. The center mural is the great panel of Divine Justice and is divided into three areas: the left area is Moses holding the tablets of the Law of the Ten Commandments; the center area is the Angel holding the Scales of Judgment; and the right area is Christ at the Temple with His new covenant, the law of love, forgiveness and salvation. The rightmost mural is of Saint Demetrios, a martyr of the Church of the third century, combating a mighty pagan warrior, suggesting the power of faith in the face of evil. Both Sts. George and Demetrios were officers in the army of the Roman Empire who became fervent Christians, subsequently suffering martyrdom for Christ. Above the center mural is a biblical inscription asking a poignant question to worshipers as they exit the cathedral: \"For what shall it profit a man if he shall gain the whole world and lose his own soul?\"</p>"
}