{
	"page" : {
		"title" : "The Sacrament of Holy Matrimony",
		"intro" : "in the Greek Orthodox Church"
	},
	"links" : [
		{
			"url" : "http://www.stsophia.org/sacraments/marriage/sacrament_of_holy_matrimony.pdf",
			"text" : "Sacrament of Holy Matrimony [PDF]"
		 },
		 {
			"url" : "http://www.stsophia.org/sacraments/marriage/ecclesiastical_requirements.pdf",
			"text" : "Ecclesiastical Requirements [PDF]"
		 },
		{ 
			"url" : "http://www.stsophia.org/sacraments/marriage/marriage_parish_requirements.pdf",
			"text" : "Parish Requirements, Obligations, Services and Fees [PDF]"
		},
		{ 
			"url" : "http://www.stsophia.org/sacraments/marriage/cathedral_policies_and_guildlines.pdf",
			"text" : "Cathedral Policies and Guidelines [PDF]"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/17r-14s5PNb-cuq7Xo12v2Q4RJYWJG_CU27dX2zK6LJc/viewform",
			"text" : "Marriage Request Form"
		},
		{ 
			"url" : "#",
			"text" : "Pay Reservation Deposit"
		},
		{ 
			"url" : "#",
			"text" : "Pay Cathedral Service Fee"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/1dQ9N-c4Axwkfdz2kEEXBOxaiQqAOfB6qU1Bt6caxmNM/viewform?embedded=true",
			"text" : "Pay Stewardship"
		}
	],
	"body-text" : "<h2>Introduction</h2><p>The Sacrament of Holy Matrimony is one of the seven sacraments observed by the Orthodox Church. The beauty and richness of this service is steeped in tradition and symbolism and has remained unchanged through the centuries. The rituals you will observe have special meaning and significance. Each is performed three times to honor the mystical presence of the Holy Trinity. Within the Orthodox theology of the Sacrament, it is God who unites the couple to become one and, in mutual love and understanding, live a Christian life together. Thus, there is no exchange of vows; rather, the conjugal union is blessed by Christ through the church. God&#39;s grace is imparted to them to live together in his love, mutually fulfilling and perfecting each other. The sacrament is divided into two distinct parts: The Service of Betrothal and the Service of Crowning.</p><h2>The Service of the Betrothal</h2><p>The Betrothal Service is comprised of petitions, prayers and the exchange of rings.The service begins with a litany of petitions for the peace of the world and for the spiritual welfare of the bride and groom. The Priest petitions God for His blessings of the rings and thrice blesses the couple with the rings, saying &#34;The servant of God, &#40;groom&#39;s name&#41;, is betrothed to the handmaiden of God, &#40;bride&#39;s name&#41;, in the name of the Father and of the Son and of the Holy Spirit.&quot; The blessing alternates between the bride and groom symbolically entwining their lives.</p><h3>The Exchange of Rings</h3><p>He then places the rings on the right hands of the bride and groom. While the final prayer is being read, the Koumbaro &#40;sponsor&#41; exchanges the rings three times, witnessing the expression of the two lives being entwined as one by the Grace of the Holy Trinity. The rings are placed onto the fingers of the right hand. As a closing prayer is offered, the agreement is sealed, and the rings assume new meaning in that God Himself has decreed the marriage.</p><h2>The Service of the Crowning</h2><p>The Service of the Crowning is the wedding proper. It is comprised of five major elements: The Prayers; The Crowning; The Scripture Readings; The Common Cup; and The Dance of Isaiah. The bride and groom are handed candles, which they hold throughout the ceremony. The candles symbolize the spiritual willingness of the couple to receive the light of Christ, who will bless them through this sacrament and guide them throughout their life together. The Prayers The Great Litany is offered by the priest, followed by three prayers. The prayers ask God to place the bride and groom into the company of holy couples from the Old and New Testaments and to &#34;bless them...protect them...and remember them.” The right hands of the couple are joined and the Priest asks God to join them in one mind and one flesh. Their hands are kept joined throughout the service to symbolize their unity.</p><h3>The Crowning</h3><p>The crowns &#40;Stefana&#41; symbolize the glory and honor that God will bestow upon the couple during the sacrament. The Stefana are joined by a ribbon that symbolizes the unity of the bride and groom in the presence of Christ, who joins them together. The Priest places the crowns on bride&#39;s and groom&#39;s heads, then the Koumbaro exchanges the Stefana three times over the couple as a symbol of complete union. The bride and groom are crowned as the king and queen of their own kingdom, the home, which they will rule with wisdom, justice and integrity.</p><h3>The Scripture Readings</h3><p>There are two readings from the New Testament. An excerpt from St. Paul&#39;s Epistle to the Ephesians &#40;5:20&ndash;33&#41; is read, expressing the strength and sacrifices required of a husband and wife, advising them to have unconditional love and service to one another and a marriage &#34;holy and without blemish.&#34; The second reading from the Gospel of St. John &#40;2:1&ndash;11&#41; relates the story of Christ at the wedding in Cana of Galilee, when Christ blessed the institution of marriage and performed the first of His miracles, transforming water into wine.</p><h3>The Common Cup</h3><p>In remembrance of this miracle, the priest brings a common cup of wine which the bride and groom sip three times, promising thereafter to share everything in life. The &#34;Common Cup&#34; symbolizes that the couple will share every joy and sorrow and that their joys will be doubled and their sorrow halved. They will always drink from the same cup of life, with faith in God, and honor and fidelity to one another.</p><h3>The Dance of Isaiah</h3><p>The Priest, holding the Holy Gospel in the right hand, leads the couple in a ceremonial walk circling the center table on which the Cross is placed. They are now taking their first steps as husband and wife. The Church, in the person of the Priest, leads them, representing that they will walk through life with the Gospel and the Cross as their center. They are accompanied by their Koumbaro who will support them throughout their married life. The procession is accompanied by the singing of three hymns, the first of which is known as the Dance of Isaiah. This hymn recalls the joy that the Prophet Isaiah felt when he envisioned the coming of the Messiah.</p><h3>The Blessing</h3><p>In a final prayer, the Priest blesses and removes the crowns, beseeching to God to grant the newlyweds a long, happy and fruitful life. He then lifts the Holy Gospel and brings it down between the bride and groom, separating the couple&#39;s joined hands, thus symbolizing that only the word of God should come between them.</p><h3>The Tradition of Koufeta</h3><p>The sugar-coated almonds, or &#34;koufeta,&#34; which are placed on the tray with the crowns and given to the guests at the reception, are symbolic of an ancient tradition. The hard bitterness of the almond represents the endurance of marriage and the sweetness of the sugar symbolizes the sweetness of future life. The guests are given an odd number of almonds which is indivisible, just as the newlyweds will remain undivided.</p><div class=\"callout\"><em>If you wish to obtain The Sacrament of Holy Matrimony in Word format for creating a personalized ceremony program, please contact the office manager at <a href=\"office@stsophia.org?\">office@stsophia.org</a>.</em></div>"
}