{
	"page" : {
		"title" : "The Sacrament of Baptism",
		"intro" : "Ecclesiastical Requirements in the Greek Orthodox Church"
	},
	"links" : [
		{
			"url" : "http://www.stsophia.org/sacraments/baptism/baptism_ecclesiastical_requirements.pdf",
			"text" : "Ecclesiastical Requirements [PDF]"
		 },
		 {
			"url" : "http://www.stsophia.org/sacraments/baptism/baptism_parish_requirements.pdf",
			"text" : "Parish Requirements, Obligations, Services and Fees [PDF]"
		 },
		{ 
			"url" : "https://docs.google.com/forms/d/1Cijqb6sP3HcISzbko4ZYQaxSgA6XCE0tUS4sQRz4c0I/viewform",
			"text" : "Baptism Request Form [PDF]"
		},
		{ 
			"url" : "#",
			"text" : "Pay Reservation Deposit"
		},
		{ 
			"url" : "#",
			"text" : "Pay Chrismation Deposit"
		},
		{ 
			"url" : "#",
			"text" : "Pay Cathedral Service Fee"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/1dQ9N-c4Axwkfdz2kEEXBOxaiQqAOfB6qU1Bt6caxmNM/viewform?embedded=true",
			"text" : "Pay Stewardship"
		}
	],
	"body-text" : "<h2>The Sacrament</h2><p>Baptism is a covenant, an agreement between God and man. God promises to be our Father and we promise to be His children. Baptising infants, before they are aware of what will take place, is an expression of God's great love for us. It shows us that God loves us and accepts us before we can even know Him or love Him. It shows us that we are wanted and loved by God from the moment of our birth. Baptism is necessary for salvation &#40;Mark 16:15-16&#41; and in accordance with the Holy Tradition, must be performed by triple immersion in the name of the Father, the Son, and the Holy Spirit &#40;Matthew 28:18&ndash;20&#41;. It is through baptism that one becomes of fully participating member of the Church.</p><p>Baptisms may not be performed on certain dates. For a list of dates, please contact the Office Manager/Sacraments Director.</p><h2>Planning for the Sacrament</h2><p><strong>Responsibilities of Parents</strong></p><ul><li>Exercise the greatest care in selecting an Orthodox Christian Godparent, who will accept the moral responsibility to provide the proper religious education, example and inspiration to his/her Godchild. </li><li>Select one name of Christian origin to be given to the child at the time of baptism.</li></ul><p><strong>Requirements of Godparent</strong><br><ul><li>Must be an Orthodox Christian, and if married, must have been married in the Orthodox Church. If divorced, must submit an Ecclesiastical Decree of Divorce.</li><li>Must submit a Parishioner in Good Standing letter, if from another Orthodox Parish.</li></ul></p><p><strong>Responsibilities of Godparent</strong><br><ul><li>Accepts the sacred responsibility to represent the child, who is being admitted to the Church through the Sacrament of Baptism and is unable to make the necessary confession of Faith. </li><li>Is prepared to recite the Nicene Creed during the baptism.</li><li>Makes a faithful lifetime commitment of love and joins the parents, guided by the Church, to assist and guide the baptized child through the Christian walk of life. </li><li>Brings the child to church regularly for Holy Communion especially the three consecutive Sundays following the baptism.</li><li>Provides the following items for the baptism:<ol><li>Complete change of white baptismal clothes for the child</li><li>A Cross for the child</li><li>Three white candles</li><li>One white bath towel</li><li>One white hand towel</li><li>One white flat twin sheet</li><li>Small bottle of olive oil</li><li>One bar of soap</li></ol></li></ul></p><div><strong>Please Review Parish Requirements, Obligations, Services and Fees</strong> </div>"
}