{
	"page" : {
		"title" : "Stewardship",
		"intro" : "Believe and Belong through Christian Stewardship"
	},
	"links" : [
		 {
			"url" : "http://www.stsophia.org/stewardship/stewardship_brochure_2013.pdf",
			"text" : "Believe and Belong [PDF]"
		 },
		{ 
			"url" : "http://www.stsophia.org/stewardship/stewardship_in_action.pdf",
			"text" : "Stewardship in Action [PDF]"
		},
		{ 
			"url" : "http://www.stsophia.org/stewardship/privileges_of_stewards.pdf",
			"text" : "Requirements, Rights, and Privileges of Saint Sophia Stewards [PDF]"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/1dQ9N-c4Axwkfdz2kEEXBOxaiQqAOfB6qU1Bt6caxmNM/viewform?embedded=true",
			"text" : "Make a Stewardship Pledge"
		},
		{ 
			"url" : "http://www.stsophia.org/stewardship/pay_stewardship.html",
			"text" : "Pay Towards Your Stewardship Pledge"
		},
		{ 
			"url" : "http://www.stsophia.org/stewardship/volunteer_opportunities_2012.pdf",
			"text" : "Ministries and Volunteer Opportunities [PDF]"
		},
		{ 
			"url" : "http://www.stsophia.org/stewardship/volunteer.html",
			"text" : "Volunteer"
		}
	],
	"body-text" : "<h2>What is Stewardship?</h2><p>Christian Stewardship is our response of gratitude and thanksgiving to God's limitless blessings and boundless love by offering Him through His Church our time, talents and treasure in proportion to what we have been given.<p><h2>Young Adult Stewardship</h2><blockquote><p>Μηδείς σου τῆς νεότητος καταφρονείτω, ἀλλὰ τύπος γίνου τῶν πιστῶν ἐν λόγῳ, ἐν ἀναστροφῇ, ἐν ἀγάπῃ, ἐν πίστει, ἐν ἁγνείᾳ.<br><br>Let no one despise or think less of you because of your youth, but be an example for the believers in speech, in conduct, in love, in faith, and in purity.</p><cite class=\"citation\">1 Timothy 4:12</cite></blockquote><p>With these words, Saint Paul admonished his disciple Timothy to stand firm as a leader in his church; not letting youth diminish his standing in the community. The Lord Himself urges all to full participation in life of the Kingdom of God. Consider when He chastised the Disciples who chided the children that approached Christ to touch Him, saying, “Allow the children to come to Me, and do not hinder them, for to such as these belongs the kingdom of heaven.\" The Lord accepts the youth, the mature adults, and the elderly all the same. Saint Sophia Cathedral carries this tradition forward, fully including our youth in the ministry of the Church. Our children learn the depths of the Orthodox faith in Sunday school, our youth dance in praise of the Lord as they celebrate the tradition of their forefathers, the young adults have built a thriving community in the Forum; each person, regardless of age has been given many opportunities to offer their time and talent to the Lord. In recognition of these facts, Saint Sophia Cathedral is introducing the Young Adult Stewardship Program for youth ages 16 to 26 at only $365 a year - yes, that's a simple dollar a day! The participating young adults will enjoy benefits tailored and structured for them:<p><ul><li>Free use of the Basketball court anytime that is not in use for the Basketball tournament or booked for other events</li><li>25% discount for adult Greek dance classes</li><li>25% discount for adult Greek language classes</li><li>25% discount of any events sponsored by the Parish Council (New Year’s Eve party, Apokries etc.)</li><li>$1,000 discount for personal events Huffington Center rentals;</li><li>and much, much more.</li></ul><p>To get started with your stewardship, <a href=\"https://docs.google.com/forms/d/18QsgmFU1_1RvNKOdCGJ63TDQsG1RztMydvMV1JMGDho/viewform\">make a pledge</a>.</p>"
}