{
	"page" : {
		"title" : "Very Reverend John S. Bakas",
		"intro" : "Dean, Saint Sophia Cathedral"
	},
	"profile-image" : {
		"img" : {
			"portrait-2x3" : {
				"src" : "../../images/fr_john_bakas.jpg",
				"alt" : "portrait photo of Father John Bakas"
			}
		}
	},
	"contact-block" : {
		"heading" : "Fr. John Bakas",
		"phone" : "+1.323.737.2424",
		"email" : "frbakas@stsophia.org"
	},"bio" : "<h2>Early Life</h2><p>Fr. John Bakas immigrated with his family to the United States from Greece in 1958. The family settled in Albuquerque, New Mexico and worked in restaurant related businesses.</p><h2>Priesthood</h2><p>Ordained to the Diaconate, March 7, 1975<br>Ordained to the Priesthood, January 21, 1979</p><p>Served the following parishes:</p><ul><li>St. George, Albuquerque, NM</li><li>Annunciation, Modesto, CA</li><li>St. George, Fresno, CA</li><li>Co-Founder and first Director of <a href=\"http://stnicholasranch.org\">St. Nicholas Ranch and Retreat Center</a> 1979-1983</li><li>Founder, St. Basil Parish in San Jose, CA 1986-1989</li><li>St. John, Las Vegas, NV (part time) 1980</li><li>St. George, Bakersfield, CA (part time) 1989</li><li>Priest of The Virgin Mary Monestary, Dunlap, CA 1992-1995</li></ul><h2>Bio</h2><p>Fr. Bakas is the Dean of Saint Sophia Cathedral and Greek Orthodox Community of Los Angeles since 1995. Along with the talented leadership of the Cathedral, he spearheaded the drive for the major renovation of the Cathedral grounds and adjacent buildings. This renovation and renewal had spawned the redevelopment of the surrounding area into what is now the Byzantine-Latino Quarter of Los Angeles. He is Founder of the Diocesan Camp AGAPE, \"Kids 'n Cancer\" program for needy children suffering with cancer. Camp AGAPE offers summer camping programs in Fresno, California; Portland, Oregon and Seattle, Washington.</p><p>He has worked as an administrator at the University of New Mexico and at California State University Stanislaus. At the University of New Mexico he taught in the Latin American Affairs Department and served as Assistant Dean of Admissions. He is tri-lingual. In addition to English he speaks, Greek and Spanish.</p><p>Father Bakas has served as Chaplain and President of the Valley Children's Hospital Foundation in Fresno. At the Children's Hospital he led the fundraising drive to build a new 170 million-dollar facility, now in operation as the nation's state of the art, premier children's hospital. He currently also teaches Greek Orthodox Theology at Loyola Marymount University in Los Angeles.</p><h2>Accomplishments</h2><p>In addition, Father Bakas is:</p><ul><li>Founder, Camp Axios camping program for Los Angeles inner city at risk youth</li><li>Founder, Rotary House Children's Hospice in Fresno, CA</li><li>Founder, Project Nino-Mexico offering free medical care for poor children in Mexico through Rotary International</li><li>Founder of the Rotary Greek Amphitheater in Fresno. It is a 2,500 seat outdoor theater and built as a mini Epidauros of ancient Greece.</li><li>Founder, Byzantine-Latino Quarter Neighborhood & Redevelopment Program in Los Angeles</li><li>Co-Chairman of the Police-Clergy Forum of the Los Angeles Police Department</li><li>Serves as Commissioner of the Los Angeles Commission on Children, Youth and Families</li></ul><h2>Personal Life</h2><p>Father Bakas is married to Presbytera Maria and has four adult children; three daughters and a son.</p><h2>Education</h2><p>Father Bakas' educational background includes:</p><ul><li>Four year training with Archdiocesan Program/Priest with Lay Profession supervised by The Holy Cross Seminary</li><li>M.A. Philosophy, University of New Mexico</li><li>Master of Theology, Loyola Marymount University</li><li>Father Bakas has served as consultant for the Orthodox perspective on Steven Spielberg's production, Prince of Egypt and Mel Gibson's, The Passion of the Christ.</li><li>He has appeared as an on-air commentator for the A&amp;E production of Christianity, The First Thousand Years and Banned from the Bible.</li><li>He was featured on the PBS program \"Visiting…with Huell Howser\".The video tour has become a favorite on area Public Television and generated daily tours to the Cathedral.</li><li>He belongs to the California Civil War Re-Enactors Society where he takes on the role (in full uniform) of General Ulysses S. Grant.</li><li>He was a tenor for the Albuquerque Light Opera.</li><li>2004 University of Southern California (USC) Baccalaureate speaker.</li></ul>"
}