{
	"page" : {
		"title" : "Fr. Allan Gabriel Boyd",
		"intro" : "Assistant Priest, Saint Sophia Cathedral"
	},
	"profile-image" : {
		"img" : {
			"portrait-2x3" : {
				"src" : "../../images/fr_allan_boyd.jpg",
				"alt" : "portrait photo of Father Allan Boyd"
			}
		}
	},
	"contact-block" : {
		"heading" : "Fr. Allan Boyd",
		"phone" : "+1.323.737.2424",
		"email" : "frboyd@stsophia.org"
	},
	"bio" : "<h2>Bio</h2><p>As the son of a deacon, Fr. Allan was raised in an Evangelical Christian tradition; being trained in the scriptures from the time he was a toddler. Straight out of high school, he immediately entered an Evangelical bible college in Lubbock, TX, where he met Danita, his wife of 30+ years. Together, they have two grown children, Joshua &amp; Faith. As an Evangelical, Fr. Allan was involved in various lay ministries - from assisting with leadership of Youth Ministry, to Teaching both Teen and Adult Sunday School, to preaching. Fr. Allan spent two years at the Evangelical bible college in Lubbock, then married his wife Danita and began their family a year or so later. For 16 years, Fr. Allan was employed with Fleming Foods Grocery Wholesale Warehouse in Phoenix, Arizona (Presbytera Danita's home state) as a warehouseman and dock foreman. During this time, an Orthodox priest from Santa Fe, NM began sending books for Fr. Allan to begin exploring Orthodox Christianity. During that time, Fr. Allan transitioned to working with the Chandler Unified School District where he managed their warehouse of sports equipment for the entire school district. From 1992 - 1998, he engaged in an aggressive scrutiny of the Orthodox Faith, until finally, he and his family chose the Orthodox Christian Faith as their own.</p><p>After a year-long catechumenate, experiencing the entire cycle of the Church's feasts and a series of year long classes, he and his family were received into the Orthodox Faith on Lazarus Saturday, 1999. During his first several years as an Orthodox Christian, he served the Church in the roles of Ierofylakas (Sacristan); Camp Counselor; Sunday School Teacher; Parish Council Member; and Radio Show Co&ndash;Host doing Orthodox apologetics on a call-in Evangelical Protestant radio station.</p><p>In 2003 Father Andrew Barakos, of Assumption Greek Orthodox Church in Scottsdale, Arizona, sent him to Hellenic College, to complete his undergrad degree in Religious Studies which was followed by the pursuit of a graduate degree. During that time, his wife, Danita, used her gifts to initiate a highly successful campus religious education program for the nearly 50 children of seminary students. While still an undergrad, Fr. Allan also served for two years as president of the Married Student's Association for both Hellenic College and Holy Cross, working as an advocate for campus family-life issues and the quality of life for the many children on campus.</p><p>After graduating from Hellenic College in 2006, with a Bachelors Degree in Religious Studies, he began attending Holy Cross Greek Orthodox School of Theology to pursue his Masters of Divinity. During his time with Holy Cross, he traveled to Albania with OCMC. For 2 weeks there, he worked in their Tirana summer-camp as a \"storyteller,\" presenting the faith to Muslim and atheist children and teenagers. In the summer of 2008, he spent several weeks traveling through Greece and Turkey, where he visited ancient Christian holy sites, including a 6-day pilgrimage through Mount Athos and a visit with His Holiness, Bartholomew, Ecumenical Patriarch. Over the course of his last academic year, Fr. Allan worked an internship with a street outreach ministry in Boston, helping to feed, clothe and connect the homeless and marginalized with both physical and spiritual resources. In March of 2009, he participated in the first annual Holy Cross Preaching Competition, where the school's faculty judges awarded him with the highest score.</p><p>Fr. Allan graduated with a Master of Divinity degree on May 16th, 2009, and began to serve at Assumption Greek Orthodox Church, in Scottsdale, Arizona, in the role of Lay Pastoral Assistant, under the guidance of Fr. Andrew Barakos. In March of 2011, His Eminence, Metropolitan Gerasimos transferred Fr. Allan to Los Angeles to begin serving as Saint Sophia's Pastoral Assistant. On June 13th, Metropolitan Gerasimos ordained Fr. Allan to the Deaconate, and then to the Holy Priesthood on July 17th, to serve as Assistant Priest at Saint Sophia Cathedral.</p>"
}