{
	"page" : {
		"title" : "First Time Visitor?",
		"intro" : "Welcome to Saint Sophia!"
	},
	"body-text" : "<h2>10 Things You should Known Before Your First Visit to an Orthodox Church</h2><h3>1. There is movement before and during worship</h3><p>During the early part of the service the church you may see people walking up to the front of the church, praying in front of the iconostasis (the standing icons in front of the altar), kissing things and lighting candles, even though the service is already going on.</p><p>In fact, when you came in the service was already going on, although the sign outside clearly said \"Divine Liturgy, 10:00 am.\" What's going on here?</p><p>In an Orthodox church there is only one Eucharistic service (Divine Liturgy) per Sunday, and it is preceded by an hour service of Matins or Orthros (8:15 am) followed by a half hour teaching in the faith (9:15 am). One begins as soon as the previous ends. Matins is a preliminary service celebrating the good news of Resurrection of Christ which make the liturgy possible which follows. From 9:45 am to 10:00 am we have a memorial service.</p><p>Orthodox worshipers arrive at any point from the beginning of Matins through the early part of the Liturgy.</p><h3>2. We Stand When We Pray</h3><p>In the Orthodox tradition, the faithful stand up for nearly the entire service. The reason for this is that we understand worship to be work. Sitting is a form of rest. We believe that when in the presence of God we should all stand. If you find the amount of standing too challenging you're welcome to sit at any time.</p><p>The liturgy at Saint Sophia begins at 10:00 am. By 10:30 am we hear the reading of the Epistle (everyone sits) and then the Gospel lesson for the day is read (everyone stands). The liturgy continues until 11:20 am when Communion is first given to children who depart for Sunday School and the parents remain in Church for the conclusion of the liturgy around noon. Following the announcements the sermon is given and Church is dismissed around noon.</p><h3>3. People Make the Sign of the Cross</h3><p>We sign ourselves whenever the Trinity is invoked, whenever we venerate the cross or an icon, and on many other occasions in the course of the Liturgy. People however, aren't expected to do everything the same way. Some cross themselves three times in a row, and some finish by sweeping their right hand to the floor. On first entering a church people may come up to an icon, crossing themselves and bowing with right hand to the floor, then kiss the icon, then make one more bow.</p><h3>4. Orthodox People Venerate</h3><p>When we first come into the church, we kiss the icons. You'll also notice that some kiss the chalice, some kiss or touch the edge of the priest's vestment as he passes by, the acolytes (altar boys) kiss his hand when they give him the censer, and we all line up to kiss the priest's hand at the end of the service as we received the blessed bread. When we talk about \"venerating\" something we usually mean crossing ourselves and kissing it.</p><p>The reason for kissing the hand of the priest has to do with our understanding that during the liturgy the hands of the priest are the hands that give out the body and blood of Christ (communion). It is also the laying on of hands that ordinations are done by the bishops. The laying on of hands goes back to the Apostles in the Orthodox Church.</p><p>We greet each other before we take communion (\"Greet one another with a kiss of love,\" 1 Peter 5:14). The usual greeting is \"Christ is in our midst\" and response, \"He is and always shall be.\" Don't worry if you forget what to say. Some of the faithful greet each other by shaking hands, while others kiss each other on each cheek. This greeting or \"kiss of peace\" is a liturgical act, a sign of mystical unity.</p><h3>5. Blessed bread and consecrated bread.</h3><p>Only Orthodox Christians may receive communion, but everyone may have some of the blessed bread offered at the conclusion of the liturgy. As we file past the priest, we come to an altar boy holding the basket of blessed bread. People will take portions for themselves and for visitors and non-Orthodox friends around them. If someone hands you a piece of blessed bread, do not panic; it is not the eucharistic Body. It is a sign of fellowship.</p><p>Visitors should not be offended that they are not allowed to receive communion. It is important to know that communion is not given out as a means of hospitality. Anyone who is not Orthodox may receive holy communion if they wish to attend classes and convert to Orthodox Christianity. Orthodox believe that receiving communion is broader than me-and-Jesus; it acknowledges faith in historic Orthodox doctrine, obedience to a particular Orthodox bishop, and a commitment to a particular Orthodox worshipping community. There's nothing exclusive about this; everyone is invited to make this commitment to the Orthodox Church. But the Eucharist is the Church's treasure, and it is reserved for those who have united themselves with the Church, and have full knowledge of what holy communion is.</p><p>We also handle the Eucharist with more gravity than many denominations do, further explaining why we guard it from common access. We believe it has been changed from ordinary bread and wine to the Body and Blood of Christ. Holy communion is a sacrament of the church, and not a symbolic gesture or right of passage. We ourselves do not receive communion unless we are making regular confession of our sins to a priest and are at peace with other communicants. We fast from all food and drink - yes, even a morning cup of coffee - from midnight the night before communion.</p><h3>6. How do we greet the clergy?</h3><p>The role of the priest is that of a spiritual father, preacher of the gospel, and the one who offers the sacraments. Part of his role is to continue the earthly ministry that St. Paul brought to the people. He is referred to in respect as father, because he is both a servant of the Lord, and also called to be the leader of the congregation. Just as St. Paul referred to himself as father of his flock in 1 Corinthians 4:14-15, the faithful refer to him in the same way as a way to honor the position of the priesthood. His wife also holds a special role as parish mother, and she gets a title too \"Presbytera\" (Greek), which means \"priest's wife.\"</p><h3>7. Hymnology That Draws Us To Pray</h3><p>At Saint Sophia, the choir is meant to lead the people in congregational singing. Traditionally, orthros hymns are chanted a capella. Most liturgies are sung with an organ as well.</p><h3>8. The Virgin Mary</h3><p>A constant feature of Orthodox worship is veneration of the Virgin Mary, the \"champion leader\" of all Christians. We often address her as \"Theotokos,\" which means \"Mother of God.\" In providing the physical means for God to become man, therefore she had a pivotal role in our salvation.</p><p>We honor her, as Scripture foretold (\"All generations will call me blessed,\" Luke 1:48). When we sing \"Through the intercession of the Theotokos, Savior, save us,\" we don't mean that she grants us eternal salvation, but that we seek her prayers for our protection and growth in faith. Just as we ask for each other's prayers, we ask for the prayers of Mary and other saints as well. They're not dead, after all, just departed to the other side. Icons surround us to remind us of all the saints who are joining us invisibly in worship. One reference to the saints surrounding us Hebrews 12:1 - \"Therefore, since we are surrounded by such a great cloud of witnesses...\"</p><h3>9. The three doors.</h3><p>Every Orthodox church will have an iconostasis before its altar. \"Iconostasis\" means \"icon-stand\", and it can be as simple as a large image of Christ on the right and a corresponding image of the Virgin and Child on the left. The basic set-up of two large icons creates, if you use your imagination, three doors. The central one, in front of the altar itself, is called the \"Holy Doors\" or \"Royal Doors,\" because there the King of Glory comes out to the congregation in the Eucharist. Only the priest and deacons, who distribute the Eucharist, use the Holy Doors.</p><p>The openings on the other sides of the icons, if there is a complete iconostasis, have doors with icons of angels; they are termed the \"Deacon's Doors.\" Altar boys and others with business behind the altar use these, although no one is to go through any of the doors without an appropriate reason.</p><h3>10. How does a \"non-Greek\" fit in?</h3><p>There are about 6 million Orthodox in North America and 350 million in the world, making Orthodoxy the second-largest Christian community. Orthodox throughout the world hold unanimously to the fundamental Christian doctrines taught by the Apostles and handed down by their successors, the bishops, throughout the centuries. One could attribute this unity to historical accident. We would attribute it to the Holy Spirit. Being Greek ethnically is not a requirement to be Greek Orthodox, just as someone can be Roman Catholic without being Roman. Because only Greek was spoken for approximately the first 300 years in the Christian church, the original church was sometimes referred to as the Greek church. It is the rule of the Orthodox Church to speak the language of the local people, therefore at Saint Sophia we speak English and Greek.</p><p>Currently the largest American jurisdictions are the Greek Orthodox Archdiocese, The Orthodox Church in America (Russian roots), and the Antiochian Archdiocese (Arabic roots). The liturgy is substantially the same in all, though there may be variation in language used and type of music.</p><p>Orthodoxy seems startlingly different at first, but as the weeks go by it gets to be less so. It will begin to feel more and more like home, and will gradually draw you into your true home, the Kingdom of God. We hope that your first visit to an Orthodox church will be enjoyable, and that it won't be your last.</p>"
}