{
	"page" : {
		"title" : "History",
		"intro" : "The History of the Greek Community of Los Angeles"
	},
	"body-text" : "<div class=\"hgroup\"><h2>The History of the Greek Community of Los Angeles<h2><h3 class=\"subheader\">Incorporated 14 June 1908</h3></div><p>The history of the Greeks of Los Angeles is the story of the dreams and aspirations of young immigrants willing to risk all to come to an unknown faraway place. Unlike their more established compatriots on the East Coast, the Greeks of the West did not have the comfort of an established \"Greek Town\" or community to welcome them. Like all Greek immigrants, they first travelled on a seemingly endless ocean voyage before entering the gates of Ellis Island. This was only the first half of their new adventure; they also had a long trip by rail across a strange, unknown continent, in search of opportunity and a dream.</p><img src=\"..\\..\\images\\cathedral-interior-loft-view.jpg\"><p>Some of them left the arid hills of their beloved Kalavrita and Soudena after the collapses of the grape market. During the economic crisis of the early 1900&rsquo;s, others left the Ionian Islands of Cephalonia and Ithaca undertaking their own personal odyssey in search of adventure, trade and fortune. Still others fled the Ottoman territories, leaving their Byzantine legacy beyond the Dardanelles, from the ancient island of Preconessos, today&rsquo;s Marmara Island. The hardships of the Balkan Wars and the threat of being conscripted into the Ottoman Turkish Army, to fight against Hellas, were intolerable for the young Hellenes. This was the background of the early Greeks who came to Los Angeles.</p><p>Little is known of the few Greek immigrants who came to Los Angeles prior to the 1890s. The majority were single males, working on the railroads, in mines and doing other labor-intensive work. Most remained bachelors, married non-Greeks or returned to Greece.</p><p>Many of the first Greeks became railroad workers on the transcontinental railroad that united the East to the West. Others were hired as miners and suffered many hardships while working the mines of Colorado and Utah before coming to Los Angeles. Greek seamen and fishermen with limited English were hired to work in the port and at other labor-intensive jobs that employed immigrants. The Los Angeles Gas and Electric Company was the first major industry to hire immigrant Greeks to dig ditches and lay lines across the Los Angeles area. The Alexandria Hotel became an early foothold for entry-level jobs where one could learn to bus tables, polish silver or wash dishes. As the young Greeks learned English, many went on to become waiters in such distinctive spots as the Brown Derby, the Ambassador Hotel, and the famous Cocoanut Grove nightclub. Some took these skills and opened their own restaurants and cafes.</p><p>Another group of early Greeks worked independently as bootblacks or trade peddlers of vegetables, fruits, candies, nuts and flowers. Many sold their fruits and vegetables near Alameda Street and were called the \"Greek Fleet\" by the locals. Twelve-hour days, seven days a week were the norm, as they gathered small nest eggs that allowed them to expand from vegetable carts to small grocery stores. In addition, smaller pastry and flower shops multiplied. Some Greeks moved from the urban area and started farms and citrus groves in Palomar, Huntington Park, San Gabriel, and San Fernando.</p><p>Like other immigrant groups, the \"padrone\" system came into being when a number of early pioneers sponsored some of their fellow patriots to come to Los Angeles and later work off the cost of their transportation. It was limited to a few in the agricultural, flower and farming trades. Although only small numbers of Greeks came to Los Angeles prior to 1900, by the beginning of the First World War, it is estimated that nearly 1000 Greeks, of whom 95 percent were male, made Los Angeles their home.</p><p>By the late 1890s, there was a small cluster of Greeks living in the Boyle Heights area, along with other immigrant groups including Russians, Syrians, Armenians, and East European Jews. The first known Greek owned grocery store in the area opened in 1896. Within a few years, several hundred Greeks settled in the area.</p><p>The influx of heavy Greek immigration and settlement in Los Angeles roughly corresponds to a chaotic time in Greek history. At the turn of the century Greece was involved in two Balkan wars, an economic crisis and the First World War. This period of domestic turmoil and international warfare created severe economic hardships in Greece. In addition, the Ottoman Empire no longer exempted Greeks from military service during the Balkan Wars, which resulted in an increased number of Greeks emigrating from areas of \"unredeemed Greece\" in the Ottoman territories.</p><p>The period of greatest immigration to America took place between the years 1900 to 1930 when over 350,000 Greeks arrived. Over 30,000 settled in New York and Chicago. The more adventurous Greeks continued by railroad to the West. By 1930, California Census data listed 10,457 \"Greek people\" in the state. Of these, some 6,488 resided in Los Angeles County. Church membership, however, listed no more than 1500 during the same time period.</p><p>As the threat of war in Greece loomed, many Greek immigrants were eager to help their beloved homeland. Before the United States entered the First World War and it appeared that Greece was in need, 140 Greeks in Los Angeles, formed the \"Greek American Military Company of Volunteers,\" bought their own uniforms and began to train. Their goal was to prepare to return to Greece if war was declared in the Balkans. This regiment trained for two hours a day after work in Elysian Park. On the weekends additional training was held. On October 26, 1912, their diligence and preparedness was recognized when they marched in the local Preparedness Parade, on Fourth and Los Angeles Streets, and were awarded the grand prize.</p><p>Some of these men returned to Greece and fought bravely in the Balkan Wars. When the United States entered World War I, over 60,000 Greek males, representing 25 percent of all Greeks in America, enlisted in the U.S. Army. That was the record for all immigrant groups. Those men were told that serving in the U.S. Army would exempt them from their Greek military obligation as well as gaining them American citizenship. After the war, a few returned to Greece only to discover that the exemption held only for men naturalized before January 15, 1914. For the vast majority, however, their much-coveted American citizenship was granted.</p><p>During this period of heavy immigration, a civil conflict took place in Greece that had an impact on the Greeks in America. Greek loyalties were split between the Republicans and the Royalists. The result of this conflict created an impetus for more immigration and often brought the dispute to Greek American communities. The early Greeks of Los Angeles, however, were largely supportive of the Republican position and thus escaped much of the conflict experienced in other parts of the country.</p><p>Immigration continued in greater numbers through the conclusion of the First World War, the Greco-Turkish War of 1921and the ultimate Catastrophe of Smyrna. The many homeless refugees, along with the League of Nations&rsquo; sponsored \"population exchange\" in 1923, resulted in an exchange of 1.5 million Greeks from Asia Minor for 750,000 Turks from Thrace and Crete. The influx of many homeless refugees to Greece constituted the last wave of immigrants coming to America. By 1924, the Greek political situation had stabilized and the agricultural market had begun to improve. As American immigration laws became more restrictive for immigrants from Eastern and Southern Europe, fewer Greeks came to Los Angeles.</p><p>The first church services were held in Los Angeles as early as 1906 in a small warehouse located at 730 North Broadway. Within two years, church services moved to 240 Anderson Street. Services were conducted by visiting Orthodox clergy from San Francisco during those years. The Los Angeles Greek Community was formally incorporated on June 14, 1908. According to the new Charter, the goals of the community included: \"To build and maintain a church as a place of worship for Greek Orthodoxy to thrive; to establish a Greek language school program for coming generations to speak the mother tongue; to establish a Greek Orthodox cemetery and other community ventures that would continue to propagate the faith and perpetuate our Hellenic traditions.\"</p><p>The Church Charter limited its membership to adult males of Greek birth or Greek parentage. \"No atheists, anarchists, communists, or criminals\" were permitted membership. Church dues were established at $6.00 per year. All other revenue was raised through contributions from the passing of the tray or the thisko at church services. A pioneer Board of Directors was soon elected to serve the new community: Louis Alexakis (first president of the new parish), George Alexakis, Jim Carellas, Gust Chicos, John Heliotis, Gust Legakis, George Mantas, Gust Markopoulos, Gust Picoulas, Peter Sakellaris, Bill Tsagalakis, Fotis Tsoumas, Thomas, Tsoumas and George Vacrinos.</p><p>The Board's first duty was to acquire a priest to serve the new community. From the very beginning, the Board had great difficulty finding a priest to come to faraway Los Angeles. As the story goes, a group of faithful resorted to a semi \"kidnapping\" when they greeted Papa Gerondeos Koutouzis on the train en route from San Francisco to Florida. After some discussion and considerable debate, the priest was offered coffee, a friendly meal, some Metaxa, and a parish. Papa Koutouzis went on to faithfully serve his new community for many years. In addition to his regular duties, he traveled to the outlying areas of Los Angeles County, ministering to the faithful in need of sacraments.</p><p>Within a few years of incorporating, the Greek community of Los Angeles was ready to build their first church. Through years of hard work and fund-raising by a handful of pioneers, O Evangelismos Tis Theotokou (The Annunciation of the Virgin Mary), fondly referred to as \"San Julian,\" located at 1216 San Julian Street, was dedicated in 1912.</p><p>Following the tenure of Papa Koutouzis, the Church of the Annunciation had two priests, the Very Reverend Ioakim Papachristos (1921-1928) and the Reverend Kallistos Pappageorgopoulos (1919-1926). In 1926, after Father Kallistos' ministry in Los Angeles, he was elevated to become the first Bishop of San Francisco and the Fourth Diocese. This added much prestige and recognition to the fledgling Greek Orthodox Church in the West. Later, Bishop Kallistos went on to become the Bishop of Chicago in a newly reorganized Greek Orthodox Church. Father Mestakides (1940-1949) and Father Kosturos (1948-1952) rounded out the clergy who ministered as Deans of the parish at The Annunciation (San Julian) Church.</p><p>The culmination of this era of accomplishment was the construction of Sophia Cathedral. Under the leadership of Charles Skouras, funds were raised to complete the magnificent Byzantine cathedral in 1952.</p><p>Father Anthony Kosturos continued to minister at Saint Sophia until 1955. The first Dean of the cathedral was Father Leonidas Contos (1952-1966). During that first year, the Saint Sophia Foundation (Board of Trustees) was established and has been the fiscal guardian of the Cathedral, while the Parish Council (Board of Directors) has been responsible for its administration.</p><p>Subsequent Deans of the cathedral have been , Father Theophilos Theophilos (1966 - 1971), Father Phillip Pekras (1971-1975), Father George Venetos (1975-1987), Father James Adams (1987-1995), and Father John Bakas (1995-present). Throughout their tenures the growth of the cathedral parish grew by leaps and bounds.</p><p>The Saint Sophia Choir flourished under the direction of Dr. Frank Desby, a scholar of Byzantine music. Many parishes around the country adopted his beautiful and innovative music. His wife, Xenia Anton Desby, was the organist from 1952 until her death in 1978. Christopher Yokas has been the organist since that time.</p><p>Providing offices and classrooms, the Charles P. Skouras Memorial Center was completed in 1957. A vital Sunday school program was developed, reaching its peak in attendance during the 60's and 70's. An integral component of the Sunday school program has been the enduringly popular Nursery.</p><p>The Saint Sophia Philoptohos Society has been a sustaining force in the life of the community. Its major fund-raisers have been the Mothers Day Luncheon and Fashion Show and the elegant Debutante Ball. Proceeds from these and other activities have supported various philanthropic charities with emphasis on assisting the sick and the needy.</p><p>G.O.Y.A., founded by Father Anthony Kosturos, experienced a large and active membership through the 50's and 60's. Its primary fund-raiser, the Coronation Ball, was held annually from 1951-1965. The 70's saw a younger group of GOYANS participating in the very popular and competitive Basketball Tournament through the Greek Orthodox Basketball League.</p><p>The camping program of the Cathedral was begun under the inspirational leadership of Father Homer Demopoulos. Located in the San Bernardino foothills, the Saint Sophia Camp and Retreat Center was purchased in 1960 and the first camping season was begun in 1962. The campsite has been used by Camp Axios, a privately funded program committed to assisting at-risk, inner-city youths of various ethnic and racial backgrounds. By renting out its facilities, Camp realized its goal of becoming financially independent. From the outset, improvements to the camp had been made by skilled and talented parishioners and their friends. Many of these parishioners were members of the Mr. and Mrs. Club. This organization was founded in 1954 and was a major supporter of the camp. The camp closed the physical facility in 2001, but the camping season continues to flourish at rented locations camp sites.</p><p>The V.I.P. Senior Citizens Group was founded in 1971 by Christine Peratis and has continued its focus on a well-rounded program for older parishioners.</p><p>With the completion of the Fellowship Hall in 1973, most community activities have been held on church grounds. It has been a welcome meeting place for Sunday Fellowship and has been consistently rented on weekends, generating additional revenue for the Cathedral.</p><p>Through generous contributions from Saint Sophia Foundation, Aris and Carolyn Anagnos, and Philoptohos, Saint Sophia Residence was dedicated in 1994. The threeÂ­ story building has been fully rented and its occupants have become a vital part of the Cathedral family.</p><p>In recent years the youth of Saint Sophia Cathedral have been successfully participating in the FDF (Folk Dance Festival) competitions.</p><p>The Cathedral has been declared an historical monument of the City of Los Angeles. Visitors have been welcomed and guided through the Cathedral by the Sextons and more recently by the Docents.</p><p>By 1995, a new phase of improvements was begun. By 1999 the Community Center had been renovated, the parking lot expanded, and the grounds beautified.</p><p>The Cathedral continues to evolve and it no longer stands alone, but has a pivotal position in the surrounding community of the Byzantine-Latino Quarter (BLQ). Plans for the C.E.S. (Cultural, Educational, Sports) Complex are being finalized as we look forward to future generations to come.</p>"
}