{
	"page" : {
		"title" : "Saint Sophia Hellenic Academy",
		"intro" : "Educating our community in the Greek language"
	},
	"links" : [
		{
			"url" : "#about-our-school",
			"text" : "About Our School"
		 },
		 {
			"url" : "#philosophy-and-vision",
			"text" : "Philosophy and Vision"
		 },
		{ 
			"url" : "#our-program-for-children",
			"text" : "Our Program for Children"
		},
		{ 
			"url" : "#our-program-for-adults",
			"text" : "Our Program for Adults"
		},
		{ 
			"url" : "",
			"text" : "Tuition and Registration"
		},
		{ 
			"url" : "#contacts",
			"text" : "Contacts"
		},
		{ 
			"url" : "",
			"text" : "Become a Steward"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/1OKGVrcUE6qZW1y2Fk7Smv_V9xu3iVWdJR78E2XlZjsU/viewform?embedded=true",
			"text" : "Child Class Registration"
		},
		{ 
			"url" : "https://docs.google.com/forms/d/1W2Rb22HNTNUNSNiXWsE54NAu8XpOYwoojN_m0j0A4v0/viewform",
			"text" : "Adult Class Registration"
		},
		{ 
			"url" : "",
			"text" : "Pay Tuition"
		}
	],
	"body-text" : "<h2>Welcome to the Saint Sophia Hellenic Academy</h2><p>For many years now, the Hellenic Academy has taught the Greek Language within a rich cultural framework. You are welcome to join our school and experience the warmth of belonging to our community regardless of your background.</p><p>Our Academy's teaching philosophy is based on the following important tenets:</p><ul><li>emphasis on active rather than passive student learning</li><li>a fine balance between structured, textbook-based classes and fun-learning activities, including great use of computer software and multimedia technology</li><li>active involvement of parents and volunteers</li><li>mutual reenforcement between conversational skills and cultural immersion</li></ul><p>Our Hellenic Academy's director, Dr. Alexandros Oxyzolou, is a college professor with many years of teaching experience. Out teachers' teaching experience and abilities are only matched with their great care for students and passion for the Greek language and culture. The school offers a curriculum designed in accordance with the Theoretical Framework for Greek Studies in the Diaspora (Greek Ministry of Education). The instruction materials have been developed especially for students who study the Greek language abroad. You may contact our director at: <a href=\"mailto:hellenic@stsophia.org\">hellenic@stsophia.org</a></p><p>Our classes are held once a week on <strong>Saturday mornings, from 9:30-12:00</strong>, in the Huffington Center, located on the beautiful Saint Sophia Cathedral grounds. For the academic year, 2014-2015, our program begins on September 20th, 2014 and ends on June 6th, 2015. Online Registration is now open until September 12th, 2014 midnight.</p><h3 id=\"about-our-school\">About Our School</h3><p>The Saint Sophia Hellenic Academy proudly continues a long history of teaching the Greek language and culture. It started in 1920, as a Greek Language School, holding classrooms in several locations in East and Southwest Los Angeles, Hollywood, Huntington Park and San Pedro.</p><p>Teaching in satellite locations continued until 1957 when the Charles P. Skouras Memorial Centre opened its classrooms on the grounds of the beautiful Saint Sophia Cathedral.</p><p>In 1995, shortly after Father John Bakas became the Dean of Saint Sophia Cathedral, a new name was given to the Greek Language School, presently known as the Hellenic Academy. In anticipation of our marvelous new buildings, in the heart of the Byzantine-Latino Quarter, the academy, as a vital Ministry of Saint Sophia Cathedral, aims at further contributing to the cultural growth of the constantly developing area.</p><h3 id=\"philosophy-and-vision\">Philosophy and Vision</h3><p>The Hellenic Academy aims at providing an enriched and friendly learning environment through which children and adults can become conversant with the Greek language and culture. Our vision is to create and/or strengthen the bonds between people who value the essence of Hellenic heritage, letters, and Orthodox faith.</p><h3 id=\"our-program-for-children\">Our Program for Children</h3><p>Our educational program begins with familiarizing children with basic vocabulary groups related to their immediate environment. Through playful and interactive processes, children start to develop basic communication skills and understanding of simple linguistic structures. Methodically and gradually the program expands its focus to include the acquisition of more complex reading, writing, and communication skills.</p><p>At all levels, elements of mythology, history and folklore are incorporated. Children learn about the Greek Gods, Ancient Greek and Byzantine history, Customs of the Greek society, national struggles like the Oxi Day and the War of Independence. They participate in cultural events, such as the cutting of the Vasilopita, Greek Independence and Oxi Day Celebrations, and Palm Tying.</p><p>Children's classes are held every Saturday, from <strong>9:30 am to 12:00 pm.</strong></p><ul><li>Pre-K (must be at least 3 years old)</li><li>Kindergarten</li><li>Beginner Levels</li><ul><li>1A/1B - must be at least 5 years old</li><li>1B/2A</li><li>2A/2B</li></ul></li><li>Intermediate Levels</li><ul><li>2B/3A</li><li>3A/3B</li><li>3B/4A</li></ul></li><li>Advanced - Certificate of Attainment in Greek (Levels A-C): This course prepares the students for the yearly examinations leading to the Certificates of Attainment in Greek - issued by the Greek Ministry of National Education and Religion.</li></ul><p>More information on the Certification can be found at: <a href=\"http://www.greeklanguage.gr/certification/\" target=\"_blank\">www.greeklanguage.gr/certification/</a> and/or <a href=\"http://www.greek-language.gr/greekLang/certification/index.html\" target=\"_blank\">www.greek-language.gr/greekLang/certification/index.html</a></p><h3 id=\"our-program-for-adults\">Our Program for Adults</h3><p>Adult courses in Modern Greek are offered for Beginners, Intermediate and Advanced levels. This program is designed for individuals who want to learn Greek or refresh their knowledge.</p><p>All levels, Beginners, Intermediate and Advanced, focus on conversational and listening skills, grammar, reading and writing at different degrees of complexity. Students begin with learning basic communicative skills, vocabulary and grammar, and gradually become familiar with more complex linguistic structures in all forms of language.</p><p>For the academic year 2012–2013, the academy will accommodate two adult classes: Beginners and Intermediate/Advanced. The latter group will accommodate and address the learning needs of both intermediate and advanced level students.</p><p><strong>Classes will begin on September 29th and will continue on a weekly basis through June 15th.</strong></p><p>Beginner class: 10:45 am - 12:00 pm.<br>Intermediate/Advanced class: 12:30 pm - 2:00 pm.</p><h3 id=\"contacts\">Who to Contact for Questions</h3><p>Educational program:<br>Dr. Andri Christodoulidou, Hellenic Academy Director<br>Email: <a href=\"mailto:andri.christodoulidou@cantab.net\">andri.christodoulidou@cantab.net</a></p><p>Payment of tuition:<br>Cathedral Accounting Office<br>Email: <a href=\"mailto:accountant@stsophia.org\">accountant@stsophia.org</a><br>Phone: (323) 737-2424, Ext.333</p>"
}