{
	"page" : {
		"title" : "Saint Sophia Hellenic Academy Tuition and Registration",
		"intro" : ""
	},
	"body-text" : "<h2>Hellenic Academy Tuition and Registration</h2><p>For the best organization and school operation, parents are strongly encouraged to register their children by September 2nd. This allows adequate time for our educators to assign students to classes and organize for the new academic year.</p><p>Please, note that there will be <strong>no registration or tuition payment on the school’s first day</strong>. You can register online, by using these links:</p><ul><li><a href=\"https://docs.google.com/forms/d/1OKGVrcUE6qZW1y2Fk7Smv_V9xu3iVWdJR78E2XlZjsU/viewform?embedded=true\">Child Class Registration</a> — Register up to 4 children at one time.</li><li><a href=\"https://docs.google.com/forms/d/1W2Rb22HNTNUNSNiXWsE54NAu8XpOYwoojN_m0j0A4v0/viewform\">Adult Class Registration</a> — For students 16 years or older.</li></ul><p class=\"callout-notice\">Please note:<br>The student is not registered until the registration form is submitted and tuition is paid.<br>If you are registering after the deadline, please contact the director prior to registration, to confirm class availability, as classes may be full.</p><h3>Children</h3><p>Annual Tuition per child student</p><ul><li>$1,000 if tuition is paid on or before September 2nd</li><li>$1,075 if tuition is paid after September 2nd</li></ul><p>Discounted tuition for Saint Sophia Stewards with a $650.00 minimum stewardship.</p><ul><li>$400.00 if tuition is paid on or before September 2nd</li><li>$475.00 if tuition is paid after September 2nd</li></ul><p>You can become a Saint Sophia Cathedral Steward and pay your stewardship online, by using this link to the <a href=\"http://www.stsophia.org/stewardship/\">Online Stewardship page.</a></p><p>Discounted tuition for Stewards from other Orthodox parishes in our Archdiocese</p><p>Must be able to provide a Parishioner in Good Standing letter. Please email a copy of your Good Standing Letter to: <a href=\"mailto:office@stsophia.org\">office@stsophia.org</a>, at time of registration.</p><ul><li>$500.00 if tuition is paid on or before September 2nd</li><li>$575.00 if tuition is paid after September 2nd.</li></ul><h3>Adults</h3><p>Adult classes are contingent upon sufficient involvement. Please make sure you complete your registration no later than September 2. If there is adequate interest, you will be notified to pay tuition. The tuition will be due by September 14.</p><p>Annual Tuition per adult student</p><ul><li>$1,000.00 if tuition is paid on or before September 14th</li><li>$1,075.00 if tuition is paid after September 14th.</li></ul><p>Discounted tuition for Saint Sophia Stewards with a $500.00 minimum stewardship.</p><ul><li>$400.00 if tuition is paid on or before September 14th</li><li>$475.00 if tuition is paid after September 14th.</li></ul><p>You can become a Saint Sophia Cathedral Steward and pay your stewardship online, by using this link to the <a href=\"http://www.stsophia.org/stewardship/\">Online Stewardship page</a>.</p><p>Discounted tuition for Stewards from other Orthodox parishes in our Archdiocese, with a Parishioner in Good Standing letter.</p><ul><li>$500.00 if tuition is paid on or before September 2nd</li><li>$575.00 if tuition is paid after September 2nd.</li></ul> <h3>Payment</h3><ul><li>You may pay tuition online using the Pay A Fee page.</li><li>You may pay in person by visiting the cathedral office and asking for the accountant.</li><li>You may pay by mail with a check addressed to Saint Sophia Cathedral.</li></ul><p>Please write on the memo line: <br>Hellenic Academy</p><p>Please mail check to:<br>Saint Sophia Cathedral<br>1324 South Normandie Avenue<br>Los Angeles, CA 90006<br></p><p class=\"callout-notice\">Please Note: if you pay by check or in person, you must submit your completed class registration form at time of payment.</p>"
}